In [7]:
import pandas as pd
import numpy as np

In [2]:
 df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
 ....: 'data1': range(6)})

In [3]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
 ....: 'data2': range(5)})

In [4]:
print(df1)
df2

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [5]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [8]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
 .....: 'b': [np.nan, 2., np.nan, 6.],
 .....: 'c': range(2, 18, 4)})

In [9]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
 .....: 'b': [np.nan, 3., 4., 6., 8.]})

In [10]:
print(df1)
df2

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [11]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [12]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
 .....: index=pd.Index(['Ohio', 'Colorado'], name='state'),
 .....: columns=pd.Index(['one', 'two', 'three'],
 .....: name='number'))

In [13]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [14]:
result = data.stack()

In [15]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [16]:
result = data.stack().unstack()

In [17]:
result

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [18]:
 s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])

In [19]:
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [21]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [22]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [23]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [24]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [27]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [31]:
df = pd.DataFrame({'left': result, 'right': result + 5}, 
                  columns=pd.Index(['left', 'right'], name='side'))

ValueError: If using all scalar values, you must pass an index

In [32]:
data = pd.read_csv('macrodata.csv')

In [33]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [34]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter, name='date')

In [38]:
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [50]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')

In [40]:
columns

Index(['realgdp', 'infl', 'unemp'], dtype='object', name='item')

In [52]:
data = data.reindex(columns=columns)

In [49]:
data

item                             realgdp  infl  unemp
date
1959-03-31 23:59:59.999999999   2710.349  0.00    5.8
1959-06-30 23:59:59.999999999   2778.801  2.34    5.1
1959-09-30 23:59:59.999999999   2775.488  2.74    5.3
1959-12-31 23:59:59.999999999   2785.204  0.27    5.6
1960-03-31 23:59:59.999999999   2847.699  2.31    5.2
...                                  ...   ...    ...
2008-09-30 23:59:59.999999999  13324.600 -3.16    6.0
2008-12-31 23:59:59.999999999  13141.920 -8.79    6.9
2009-03-31 23:59:59.999999999  12925.410  0.94    8.1
2009-06-30 23:59:59.999999999  12901.504  3.37    9.2
2009-09-30 23:59:59.999999999  12990.341  3.56    9.6

[203 rows x 3 columns]

In [43]:
data.index = periods.to_timestamp('D', 'end')

In [44]:
data.head()

item                            realgdp  infl  unemp
date
1959-03-31 23:59:59.999999999  2710.349  0.00    5.8
1959-06-30 23:59:59.999999999  2778.801  2.34    5.1
1959-09-30 23:59:59.999999999  2775.488  2.74    5.3
1959-12-31 23:59:59.999999999  2785.204  0.27    5.6
1960-03-31 23:59:59.999999999  2847.699  2.31    5.2

In [45]:
ldata = data.stack().reset_index().rename(columns={0: 'value'})

In [46]:
ldata

                             date     item      value
0   1959-03-31 23:59:59.999999999  realgdp   2710.349
1   1959-03-31 23:59:59.999999999     infl      0.000
2   1959-03-31 23:59:59.999999999    unemp      5.800
3   1959-06-30 23:59:59.999999999  realgdp   2778.801
4   1959-06-30 23:59:59.999999999     infl      2.340
..                            ...      ...        ...
604 2009-06-30 23:59:59.999999999     infl      3.370
605 2009-06-30 23:59:59.999999999    unemp      9.200
606 2009-09-30 23:59:59.999999999  realgdp  12990.341
607 2009-09-30 23:59:59.999999999     infl      3.560
608 2009-09-30 23:59:59.999999999    unemp      9.600

[609 rows x 3 columns]

In [53]:
ldata['value2'] = np.random.randn(len(ldata))

In [54]:
ldata.head()

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349  0.560122
1 1959-03-31 23:59:59.999999999     infl     0.000 -0.987507
2 1959-03-31 23:59:59.999999999    unemp     5.800 -1.543888
3 1959-06-30 23:59:59.999999999  realgdp  2778.801 -0.515866
4 1959-06-30 23:59:59.999999999     infl     2.340  0.295959

In [55]:
pivoted = ldata.pivot('date', 'item')

In [56]:
pivoted

                              value                     value2            \
item                           infl    realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00   2710.349   5.8 -0.987507  0.560122
1959-06-30 23:59:59.999999999  2.34   2778.801   5.1  0.295959 -0.515866
1959-09-30 23:59:59.999999999  2.74   2775.488   5.3  0.325056  0.134407
1959-12-31 23:59:59.999999999  0.27   2785.204   5.6 -1.376163 -0.002030
1960-03-31 23:59:59.999999999  2.31   2847.699   5.2 -1.291513  1.310093
...                             ...        ...   ...       ...       ...
2008-09-30 23:59:59.999999999 -3.16  13324.600   6.0  0.927229  0.602035
2008-12-31 23:59:59.999999999 -8.79  13141.920   6.9 -0.539240 -1.064040
2009-03-31 23:59:59.999999999  0.94  12925.410   8.1 -0.892405 -1.551123
2009-06-30 23:59:59.999999999  3.37  12901.504   9.2  0.842180 -0.365141
2009-09-30 23:59:59.999999999  3.56  12990.341   9.6  0.126321  0.263130


item                              unemp
date
1959-03-31 23:59:59.999999999 -1.543888
1959-06-30 23:59:59.999999999 -0.425493
1959-09-30 23:59:59.999999999 -0.396396
1959-12-31 23:59:59.999999999 -0.665223
1960-03-31 23:59:59.999999999 -0.953167
...                                 ...
2008-09-30 23:59:59.999999999  0.188754
2008-12-31 23:59:59.999999999  2.237617
2009-03-31 23:59:59.999999999 -0.483587
2009-06-30 23:59:59.999999999 -1.582159
2009-09-30 23:59:59.999999999 -0.802841

[203 rows x 6 columns]

In [57]:
 df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
 .....: 'A': [1, 2, 3],
 .....: 'B': [4, 5, 6],
 .....: 'C': [7, 8, 9]})

In [58]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [59]:
 melted = pd.melt(df, ['key'])

In [60]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [61]:
reshaped = melted.pivot('key', 'variable', 'value')

In [62]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7